package com.kh.regularEx;
/*
 
 https://regexr.com/
 а╓╠т╫д(Regular Expression)
 	╧╝юз©╜©║╪╜ ф╞а╓гя ╠тд╒юлЁ╙ фпеою╩ цё╟еЁ╙ ╟к╩Жгр ╤╖ ю╞©Кго╟т ╩Г©Кго╠Б ю╖гя г╔гЖ ╧Ф╧Щ
 	
 	1. ╧╝юз
	 	[abc] : a,b,c аъ гоЁ╙©м юод║го╦И ╣й
	 	[^abc] : a,b,c юл©эюг ╧╝юз©м юод║го╦И ╣й
	 	[a-z] : ╪р╧╝юз a╨нем z╠НаЖ ╧╝юз©м юод║го╢баЖ х╝юн
	 	[A-Z] : ╢К╧╝юз A╨нем Z╠НаЖ ╧╝юз©м юод║го╢баЖ х╝юн
	 	[0-9] : ╪Щюз 0-9 ╧╝юз©м юод║го╢баЖ х╝юн
	 	[╟║-фR] : гя╠ш ╟║ - фR ╦П╣Г гя╠ш ╧╝юз╟║ юод║го╢баЖ х╝юн
	 	[╓║-╓╬] : юзю╫ ╓║ - ╓╬ ╦П╣Г юзю╫юл юод║го╢баЖ х╝юн
	 	[╓©-╓с] : ╦Пю╫ ╓© - ╓с ╦П╣Г юзю╫юл юод║го╢баЖ х╝юн
 	
 	2. аЖа╓юз
 	 		* : 0╟Ё юл╩С ╧╝юз©м юод║
 	 		+ : 1╟Ё юл╩С ╧╝юз©м юод║
 	 		? : 0 ╤г╢б 1╟Ёюг ╧╝юз©м юод║
 	 	  {n} : а╓х╝го╟т n╟Ёюг ╧╝юз©м юод║
 	 	  {n,}: цж╪р n╟Ё юл╩Сюг ╧╝юз©м юод║
 	 	 {n,m}: цж╪р n╟Ё юл╩С цж╢К m╟Ёюг ╧╝юз©м юод║
 	 	 
 	 3. ф╞╪Ж╧╝юз
 	 	 	. : ╬Н╤╡ гя ╧╝юз©м юод║
 	 	 	^ : ╧╝юз©╜юг ╫цюш╨н╨п╟З юод║
 	 	 	$ : ╧╝юз©╜юг Ё║╨н╨п╟З юод║
 	 	 	\ : ф╞╪Ж╧╝юз╦╕ ╩Г©Кгр ╟мюс ╬к╥ааж╢б ╟м
 	 	 		ф╞╪Ж╧╝юз╦╕ ╩Г©Кго╠Ф ©Ьгя╢ы╦И \ юш╪╨ хд ╣з©║ юШ╬НаЮ╬ъгт
 	 
 	 а╓╠т╫дю╩ ╩Г©Кгр ╤╖ ╩Г©Кго╢б ╧Ф╧Щю╨ ©╘╥╞╟║аЖ южю╫
 	 Pattern.matches() ╦╕ ╩Г©Кгь╪╜ юЭц╪╧╝юз©╜юл а╓╠т╫д╟З юод║го╢баЖ ©╘╨н╦╕ х╝юнго╢б╣╔ ╩Г©К
 	 
 	 ╧╝юз©╜ ╬х©║╪╜ ф╞а╓ ╨н╨п╦╦ а╓╠т╫д╟З юод║го╢баЖ х╝юнго╢б ╨н╨п
 	 Matcher.find()		Matcher.matches()
 	 String.split()
 	 
 */
public class а╓╠т╫д {

}
